Pandas - DataFrame

In [30]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

1. DataFrame 생성

In [6]:
kor =  [80, 90, 70, 30]
eng = np.array([90, 70, 60, 40])
math = (90, 60, 80, 70)

In [8]:
df = pd.DataFrame({
    '국어': kor, '영어': eng, '수학': math},
                  index=['춘향', '몽룡', '향단', '방자'])
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [11]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(40,101,12).reshape(4,3),
                   columns=['국어', '영어', '수학'],
                   index=['춘향', '몽룡', '향단', '방자'])
df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

2. indexing

In [15]:
df['국어']['춘향'], df.국어['춘향'], df.국어[0], df['국어'][0], df.국어.춘향

(80, 80, 80, 80, 80)

In [16]:
df.국어

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [18]:
df.영어[1:3]

몽룡    70
향단    60
Name: 영어, dtype: int32

- 연습문제 4.1.3

In [19]:
# 1) 모든 학생의 수학 점수를 시리즈로
df.수학

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [21]:
# 2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [25]:
# 3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가
df['평균'] = df.mean(axis=1).round()
df

    국어  영어  수학    평균
춘향  80  90  90  87.0
몽룡  90  70  60  73.0
향단  70  60  80  70.0
방자  30  40  70  47.0

In [31]:
# 4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산
df.영어.방자 = 80
df.평균 = df.mean(axis=1)
df

    국어  영어  수학       평균
춘향  80  90  90  86.6875
몽룡  90  70  60  73.3125
향단  70  60  80  70.0000
방자  30  80  70  59.1875

In [38]:
# 5) 춘향의 점수를 데이터프레임으로
df[0:1]

    국어  영어  수학       평균
춘향  80  90  90  86.6875

In [39]:
df.iloc[0:1]

    국어  영어  수학       평균
춘향  80  90  90  86.6875

In [40]:
df.iloc[:1, :-1]

    국어  영어  수학
춘향  80  90  90

In [45]:
# 6) 향단의 점수를 시리즈로
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [46]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [47]:
df.T

         춘향       몽룡    향단       방자
국어  80.0000  90.0000  70.0  30.0000
영어  90.0000  70.0000  60.0  80.0000
수학  90.0000  60.0000  80.0  70.0000
평균  86.6875  73.3125  70.0  59.1875

In [50]:
df.loc['춘향']

국어    80.0000
영어    90.0000
수학    90.0000
평균    86.6875
Name: 춘향, dtype: float64

In [59]:
# 평균 열 삭제
del df['평균']
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [60]:
# 영어, 수학 점수를 삭제
df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

In [61]:
# 없앤 효과
df3 = df2[['국어']]
df3

    국어
춘향  92
몽룡  40
향단  62
방자  69

In [63]:
# drop()사용
df2.drop(columns=['영어', '수학'])

    국어
춘향  92
몽룡  40
향단  62
방자  69

In [65]:
df2
# 바뀌지 않음
# DataFrame에서는 자기 자신을 변화시키려면 inplace=True 옵션을 주어야 함

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

In [66]:
df2.drop(columns=['영어', '수학'], inplace=True)
df2

    국어
춘향  92
몽룡  40
향단  62
방자  69

In [67]:
# 행 삭제
df2.drop(['방자'])

    국어
춘향  92
몽룡  40
향단  62

In [68]:
df2

    국어
춘향  92
몽룡  40
향단  62
방자  69

In [69]:
df2.drop(index=['방자'], inplace=True)
df2

    국어
춘향  92
몽룡  40
향단  62

- loc, iloc 인덱서

In [70]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [73]:
# 춘향, 몽룡의 영어, 수학 점수
# 숫자로 쓸 때에는 index 마지막 -1 이지만 
# str로 쓸 때에는 마지막을 포함한다.
df.loc['춘향':'몽룡', '영어':]

    영어  수학
춘향  90  90
몽룡  70  60

In [71]:
# 몽룡, 향단의 국어, 수학 점수
df.iloc[1:3, ::2]

    국어  수학
몽룡  90  60
향단  70  80

In [77]:
# 몽룡, 향단의 영어, 수학 점수
df.iloc[1:3, 1:]

    영어  수학
몽룡  70  60
향단  60  80

In [76]:
# 향단, 방자의 국어, 영어
df.iloc[2:, :-1]

    국어  영어
향단  70  60
방자  30  80